# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

# l = [1, 1, 2, 0, -1, 3, 4, 4]
# l_2 = []
# length = len(l)
# for i in range(length):
#     if l[i] not in l_2:
#         l_2.append(l[i])
# print(len(l_2))

# или можно решить через set(читерский способ!)

l = [1, 1, 2, 2, 0, 0, -1, 3, 4, 4, 45, 3, 43, 53242, 5234, 532, 754, 54, 43,43]
print(len(set(l)))
print(type(l))

